In [14]:
import pandas as pd

In [15]:
import numpy as np

In [16]:
pd.__version__

'1.0.1'

In [2]:
#python
import pandas as pd
order = pd.read_csv('order.csv', names=['id', 'ts', 'uid', 'orderid', 'amount'])
order.head()

   id                ts    uid      orderid  amount
0  id                ts    uid      orderid  amount
1   1   2019/08/01 9:15  10005  2.01908E+13   48.43
2   2  2019/08/01 10:00  10001  2.01908E+13   89.33
3   3  2019/08/01 10:04  10003  2.01908E+13   63.86
4   4  2019/08/01 12:17  10002  2.01908E+13    3.16

### realize this sql in pandas

----
select
    *
    ,subtstr(ts, 1, 10) as dt
    ,substring(orderid, 1, 8) as dt2
from t_order

----

In [20]:
order_data['dt'] = order_data['ts'].str[:10]
order_data.head()

   id                ts    uid       orderid  amount          dt
0   1   2019/08/01 9:15  10005  2.019080e+13   48.43  2019/08/01
1   2  2019/08/01 10:00  10001  2.019080e+13   89.33  2019/08/01
2   3  2019/08/01 10:04  10003  2.019080e+13   63.86  2019/08/01
3   4  2019/08/01 12:17  10002  2.019080e+13    3.16  2019/08/01
4   5  2019/08/01 14:05  10001  2.019080e+13   87.15  2019/08/01

In [21]:
# astype(str) ≈ cast (xxx as str)
order_data['dt2'] = order_data['orderid'].astype(str).str[:8]
order_data.head()

   id                ts    uid       orderid  amount          dt       dt2
0   1   2019/08/01 9:15  10005  2.019080e+13   48.43  2019/08/01  20190800
1   2  2019/08/01 10:00  10001  2.019080e+13   89.33  2019/08/01  20190800
2   3  2019/08/01 10:04  10003  2.019080e+13   63.86  2019/08/01  20190800
3   4  2019/08/01 12:17  10002  2.019080e+13    3.16  2019/08/01  20190800
4   5  2019/08/01 14:05  10001  2.019080e+13   87.15  2019/08/01  20190800

In [24]:
# strなので、08/01 ≠ 08-01
order_08_01 = order_data[order_data['ts'].astype(str).str.contains('08/01')]
order_08_01

   id                ts    uid       orderid  amount          dt       dt2
0   1   2019/08/01 9:15  10005  2.019080e+13   48.43  2019/08/01  20190800
1   2  2019/08/01 10:00  10001  2.019080e+13   89.33  2019/08/01  20190800
2   3  2019/08/01 10:04  10003  2.019080e+13   63.86  2019/08/01  20190800
3   4  2019/08/01 12:17  10002  2.019080e+13    3.16  2019/08/01  20190800
4   5  2019/08/01 14:05  10001  2.019080e+13   87.15  2019/08/01  20190800
5   6  2019/08/01 14:05  10004  2.019080e+13   88.65  2019/08/01  20190800

In [37]:
order_data['dt3'] = order_data['ts'].astype(str).str.extract('(\d{4}/\d{2}/\d{2}).*')
order_data.head()

,id,ts,uid,orderid,amount,dt,dt2,dt3
0,1,2019/08/01 9:15,10005,2.019080e+13,48.43,2019/08/01,20190800,2019/08/01
1,2,2019/08/01 10:00,10001,2.019080e+13,89.33,2019/08/01,20190800,2019/08/01
2,3,2019/08/01 10:04,10003,2.019080e+13,63.86,2019/08/01,20190800,2019/08/01
3,4,2019/08/01 12:17,10002,2.019080e+13,3.16,2019/08/01,20190800,2019/08/01
4,5,2019/08/01 14:05,10001,2.019080e+13,87.15,2019/08/01,20190800,2019/08/01

In [39]:
order_data['dt4'] = order_data['ts'].astype(str).str.replace('/','-')
order_data.head()

,id,ts,uid,orderid,amount,dt,dt2,dt3,dt4
0,1,2019/08/01 9:15,10005,2.019080e+13,48.43,2019/08/01,20190800,2019/08/01,2019-08-01 9:15
1,2,2019/08/01 10:00,10001,2.019080e+13,89.33,2019/08/01,20190800,2019/08/01,2019-08-01 10:00
2,3,2019/08/01 10:04,10003,2.019080e+13,63.86,2019/08/01,20190800,2019/08/01,2019-08-01 10:04
3,4,2019/08/01 12:17,10002,2.019080e+13,3.16,2019/08/01,20190800,2019/08/01,2019-08-01 12:17
4,5,2019/08/01 14:05,10001,2.019080e+13,87.15,2019/08/01,20190800,2019/08/01,2019-08-01 14:05